module sim_IMem;

    // 测试信号
    reg [5:0] A;
    wire [31:0] RD;
    
    // 实例化被测模块
    IMem uut(A, RD);
    
    // 测试过程
    initial begin
        // 初始化信号
        A = 0;
        
        // 等待存储器初始化完成
        #10;
        
        // 测试1: 顺序读取测试
        A = 6'h00; #10;
        A = 6'h01; #10;
        A = 6'h02; #10;
        A = 6'h03; #10;
        A = 6'h04; #10;
        A = 6'h05; #10;
        
           A = 6'h06; #10;
             A = 6'h07; #10;
             A = 6'h08; #10;
             A = 6'h09; #10;
             A = 6'h10; #10;
         
        A = 6'h20; #10;
     
    end
endmodule
